[Killed] BlockStatement
stryker/stryker_mutation_testing/warrior/warriorAge.js:1:32
-function isUserOldEnough(user) {
-    return user.age >= 18;
-}
+function isUserOldEnough(user) {}
 
 function isPositive(number) {
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] EqualityOperator
stryker/stryker_mutation_testing/warrior/warriorAge.js:2:12
 function isUserOldEnough(user) {
-    return user.age >= 18;
+    return user.age < 18;
 }
 
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] ConditionalExpression
stryker/stryker_mutation_testing/warrior/warriorAge.js:2:12
 function isUserOldEnough(user) {
-    return user.age >= 18;
+    return false;
 }
 
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] BlockStatement
stryker/stryker_mutation_testing/warrior/warriorAge.js:5:29
     return user.age >= 18;
 }
 
-function isPositive(number) {
-    var result = false;
-    if (number >= 0) {
-        result = true;
-    } 
-    return result;
-}
+function isPositive(number) {}
 
 module.exports = {
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] BooleanLiteral
stryker/stryker_mutation_testing/warrior/warriorAge.js:6:18
 }
 
 function isPositive(number) {
-    var result = false;
+    var result = true;
     if (number >= 0) {
         result = true;
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] EqualityOperator
stryker/stryker_mutation_testing/warrior/warriorAge.js:7:9
 
 function isPositive(number) {
     var result = false;
-    if (number >= 0) {
+    if (number > 0) {
         result = true;
     } 
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] BlockStatement
stryker/stryker_mutation_testing/warrior/warriorAge.js:7:22
 
 function isPositive(number) {
     var result = false;
-    if (number >= 0) {
-        result = true;
-    } 
+    if (number >= 0) {} 
     return result;
 }
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`

[Killed] BooleanLiteral
stryker/stryker_mutation_testing/warrior/warriorAge.js:8:18
 function isPositive(number) {
     var result = false;
     if (number >= 0) {
-        result = true;
+        result = false;
     } 
     return result;
killedBy: All tests
statusReason: > mutant@1.0.0 test
> jest


watchman warning:  opendir(/Users/luizmacedo/Library/Caches/com.apple.HomeKit.configurations) -> Operation not permitted. Marking this portion of the tree deleted
To clear this warning, run:
`watchman watch-del /Users/luizmacedo/Library ; watchman watch-project /Users/luizmacedo/Library`
